In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'], 
                   'data1' : np.random.randn(5), 
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one -1.249836  0.318300
1    a  two -0.906702  1.087233
2    b  one -1.834854  1.435668
3    b  two -1.361599  1.334766
4    a  one -1.591005 -0.104469

In [6]:
grouped = df['data1'].groupby(df['key1'])

grouped

In [8]:
grouped.mean()

key1
a   -1.249181
b   -1.598227
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -1.420421
      two    -0.906702
b     one    -1.834854
      two    -1.361599
Name: data1, dtype: float64

In [10]:
means.unstack()

key2       one       two
key1
a    -1.420421 -0.906702
b    -1.834854 -1.361599

In [11]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])

In [14]:
years = np.array([2005,2005,2006,2005,2006])

In [16]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.906702
            2006   -1.834854
Ohio        2005   -1.305717
            2006   -1.591005
Name: data1, dtype: float64

In [18]:
df['data1'].groupby([states,years])

In [19]:
df['data1']

0   -1.249836
1   -0.906702
2   -1.834854
3   -1.361599
4   -1.591005
Name: data1, dtype: float64

In [20]:
df

  key1 key2     data1     data2
0    a  one -1.249836  0.318300
1    a  two -0.906702  1.087233
2    b  one -1.834854  1.435668
3    b  two -1.361599  1.334766
4    a  one -1.591005 -0.104469

In [21]:
df.groupby('key1').mean()

         data1     data2
key1
a    -1.249181  0.433688
b    -1.598227  1.385217

In [22]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -1.420421  0.106915
     two  -0.906702  1.087233
b    one  -1.834854  1.435668
     two  -1.361599  1.334766

In [23]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64